union isfuzzy=true
    (DeviceProcessEvents
    | extend
        EventSource = "Process",
        Cmd = tostring(ProcessCommandLine)
    ),
    (DeviceEvents
    | extend
        EventSource = "Event",
        Cmd = tostring(AdditionalFields)
    )
| where tolower(FileName) == "powershell.exe"
| where tolower(tostring(InitiatingProcessFileName)) != "slack.exe"
| extend cmd_lc = tolower(tostring(Cmd))
| extend KeywordCount =
iif(cmd_lc has_any ("IEX", "iex", "invoke-expression", "invoke-expression"), 1, 0) +
iif(cmd_lc has "get-clipboard", 1, 0) +
iif(cmd_lc has "add-type", 1, 0) +
iif(cmd_lc has "showwindow", 1, 0) +
iif(cmd_lc has "net.httpwebrequest", 1, 0) +
iif(cmd_lc has "scriptblock::create", 1, 0) +
iif(cmd_lc matches regex @"h.?t.?t.?p.?s?:", 1, 0)
| where KeywordCount >= 2
| project
TimeGenerated,
DeviceName,
InitiatingProcessFileName,
FileName,
ProcessCommandLine = iif(isnotempty(ProcessCommandLine), ProcessCommandLine, Cmd),
AccountName,
InitiatingProcessCommandLine
| order by TimeGenerated desc
| summarize
Count = count(),
SampleCommands = make_set(ProcessCommandLine, 5),
FirstSeen=min(TimeGenerated),
LastSeen=max(TimeGenerated)
by DeviceName, AccountName, bin(TimeGenerated, 2m)
| where Count >= 2
